In [1]:
#importing libraries
import pandas as pd
import sqlite3

In [2]:
#installing the lib  ipython-sql to use sql commands
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\admin\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (3.6.0)
Requirement already satisfied: sqlparse in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (2.0.5.post1)
Requirement already satisfied: ipython in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: ipython-genutils in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in c:\users\admin\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\admin\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.3.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\admin\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: matplotlib-inline in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pygments in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: colorama in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.5)
Requirement already satisfied: setuptools>=18.5 in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (63.4.1)
Requirement already satisfied: traitlets>=4.2 in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: jedi>=0.16 in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: pickleshare in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: backcall in c:\users\admin\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: wcwidth in c:\users\admin\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\admin\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)

In [22]:
!pip install --upgrade ipython

Requirement already satisfied: ipython in c:\users\admin\anaconda3\lib\site-packages (7.31.1)
Collecting ipython
  Downloading ipython-8.11.0-py3-none-any.whl (793 kB)
     ------------------------------------- 793.3/793.3 kB 82.7 kB/s eta 0:00:00
Requirement already satisfied: jedi>=0.16 in c:\users\admin\anaconda3\lib\site-packages (from ipython) (0.18.1)
Requirement already satisfied: pickleshare in c:\users\admin\anaconda3\lib\site-packages (from ipython) (0.7.5)
Requirement already satisfied: matplotlib-inline in c:\users\admin\anaconda3\lib\site-packages (from ipython) (0.1.6)
Collecting stack-data
  Downloading stack_data-0.6.2-py3-none-any.whl (24 kB)
Requirement already satisfied: pygments>=2.4.0 in c:\users\admin\anaconda3\lib\site-packages (from ipython) (2.11.2)
Requirement already satisfied: traitlets>=5 in c:\users\admin\anaconda3\lib\site-packages (from ipython) (5.1.1)
Requirement already satisfied: backcall in c:\users\admin\anaconda3\lib\site-packages (from ipython) (0.2.0)
Collecting prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30
  Downloading prompt_toolkit-3.0.38-py3-none-any.whl (385 kB)
     ------------------------------------- 385.8/385.8 kB 40.6 kB/s eta 0:00:00
Requirement already satisfied: decorator in c:\users\admin\anaconda3\lib\site-packages (from ipython) (5.1.1)
Requirement already satisfied: colorama in c:\users\admin\anaconda3\lib\site-packages (from ipython) (0.4.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\admin\anaconda3\lib\site-packages (from jedi>=0.16->ipython) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\admin\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30->ipython) (0.2.5)
Collecting asttokens>=2.1.0
  Downloading asttokens-2.2.1-py2.py3-none-any.whl (26 kB)
Collecting executing>=1.2.0
  Downloading executing-1.2.0-py2.py3-none-any.whl (24 kB)
Collecting pure-eval
  Downloading pure_eval-0.2.2-py3-none-any.whl (11 kB)
Requirement already satisfied: six in c:\users\admin\anaconda3\lib\site-packages (from asttokens>=2.1.0->stack-data->ipython) (1.16.0)
Installing collected packages: pure-eval, executing, prompt-toolkit, asttokens, stack-data, ipython
  Attempting uninstall: prompt-toolkit
    Found existing installation: prompt-toolkit 3.0.20
    Uninstalling prompt-toolkit-3.0.20:
      Successfully uninstalled prompt-toolkit-3.0.20
  Attempting uninstall: ipython
    Found existing installation: ipython 7.31.1
    Uninstalling ipython-7.31.1:
      Successfully uninstalled ipython-7.31.1
Successfully installed asttokens-2.2.1 executing-1.2.0 ipython-8.11.0 prompt-toolkit-3.0.38 pure-eval-0.2.2 stack-data-0.6.2

ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
spyder 5.2.2 requires pyqt5<5.13, which is not installed.
spyder 5.2.2 requires pyqtwebengine<5.13, which is not installed.
spyder 5.2.2 requires ipython<8.0.0,>=7.6.0, but you have ipython 8.11.0 which is incompatible.
spyder-kernels 2.2.1 requires ipython<8,>=7.6.0; python_version >= "3", but you have ipython 8.11.0 which is incompatible.

In [44]:
# Using pandas to read_csv file to DataFrame
customers = pd.read_csv('data/customers.csv')
products = pd.read_csv('data/products.csv')
orders = pd.read_csv('data/orders.csv')

In [4]:
customers.head()

   id             name billing_country
0   1  Serenity Ladner          Canada
1   2     Lucy Baldwin          Canada
2   5   Skylar Coffman             USA
3   6     Riley Kinsey             USA
4   7   Heidi Spurlock          Canada

In [5]:
orders.head()

   id  customer_id  product_id delivery_country
0   0         1866         686            India
1   1         1921         617            China
2   1         1921          54          Armenia
3   1         1921         566            China
4   1         1921         128          Lebanon

**Now open an SQL DataBase, then convert above DataFrames to SQL tables**

In [45]:
#Connecting sqlite3 and creating a Database
conn = sqlite3.connect("testdb.db")

In [46]:
# Loading dataframes to tables of created database through the connector "conn"
customers.to_sql("customers", conn, index=False, if_exists="replace")
products.to_sql("products", conn, index=False, if_exists="replace")
orders.to_sql("orders", conn, index=False, if_exists="replace")

2000

In [1]:
# Loading the sql module to ipython using line magic
%load_ext sql

In [47]:
# Pointing the Jupyter sql library to the created database named "testdb.db"
%sql sqlite:///testdb.db

In [48]:
# Using magic line %sql  to switch to sql syntax (CRUD operations)
%sql SELECT * FROM customers LIMIT 20;

 * sqlite:///testdb.db
Done.

[(1, 'Serenity Ladner', 'Canada'),
 (2, 'Lucy Baldwin', 'Canada'),
 (5, 'Skylar Coffman', 'USA'),
 (6, 'Riley Kinsey', 'USA'),
 (7, 'Heidi Spurlock', 'Canada'),
 (10, 'Makenna Rojas', 'Canada'),
 (15, 'Lillian Strange', 'Canada'),
 (17, 'Erin Gorman', 'Canada'),
 (18, 'Abigail Le', 'USA'),
 (22, 'Alana Herzog', 'USA'),
 (30, 'Amelia Kruger', 'Canada'),
 (31, 'Katherine Lilly', 'USA'),
 (32, 'Nicole Fitch', 'Canada'),
 (33, 'Reagan Floyd', 'Canada'),
 (34, 'Penelope Robinson', 'Canada'),
 (41, 'Crystal Barney', 'Canada'),
 (46, 'Guadalupe Childers', 'Canada'),
 (49, 'Amelia Sosa', 'USA'),
 (53, 'Hillary Davis', 'UK'),
 (56, 'Ethel Edwards', 'UK')]

In [49]:
%sql SELECT * FROM orders LIMIT 10;

 * sqlite:///testdb.db
Done.

[(0, 1866, 686, 'India'),
 (1, 1921, 617, 'China'),
 (1, 1921, 54, 'Armenia'),
 (1, 1921, 566, 'China'),
 (1, 1921, 128, 'Lebanon'),
 (1, 1921, 976, 'China'),
 (2, 1907, 353, 'Spain'),
 (3, 1464, 330, 'Denmark'),
 (3, 1464, 555, 'Denmark'),
 (4, 206, 960, 'Mexico')]

In [30]:
# Using magic line %sql  to switch to sql syntax (CRUD operations)
%sql SELECT * FROM customers WHERE billing_country = 'Canada'  LIMIT 10;

 * sqlite:///testdb.db
Done.

[(1, 'Serenity Ladner', 'Canada'),
 (2, 'Lucy Baldwin', 'Canada'),
 (7, 'Heidi Spurlock', 'Canada'),
 (10, 'Makenna Rojas', 'Canada'),
 (15, 'Lillian Strange', 'Canada'),
 (17, 'Erin Gorman', 'Canada'),
 (30, 'Amelia Kruger', 'Canada'),
 (32, 'Nicole Fitch', 'Canada'),
 (33, 'Reagan Floyd', 'Canada'),
 (34, 'Penelope Robinson', 'Canada')]

In [50]:
# Insert a new entry into table 'customers'
%sql INSERT INTO customers (id, name, billing_country) VALUES(11, 'Tran Thi Xuan', 'Vietnam');

 * sqlite:///testdb.db
1 rows affected.

[]

In [51]:
%sql SELECT * FROM customers WHERE name LIKE 'Tran Thi Xuan';

 * sqlite:///testdb.db
Done.

[(11, 'Tran Thi Xuan', 'Vietnam')]

In [63]:
# Save the sql query results to a variable
 
%sql result << SELECT orders.*, customers.name  FROM orders INNER JOIN customers ON orders.id = customers.id WHERE delivery_country = 'India';

 * sqlite:///testdb.db
Done.
Returning data to local variable result

In [74]:
 result.csv('data/joined_data.csv')

CSV results at C:\Users\Admin\Desktop\notebooks\Lesson02\data/joined_data.csv

In [75]:
# Read an sql table named "sql_query" into DataFrame
df = pd.read_csv('data/joined_data.csv')

In [76]:
df

     id  customer_id  product_id delivery_country                      name
0    68         1857         265            India           Hollye Thompson
1   201         1891         340            India  Geavonna Amado Benavides
2   201         1891         858            India  Geavonna Amado Benavides
3   209          839         456            India     Dominga Millan Santos
4   209          839         556            India     Dominga Millan Santos
5   209          839         667            India     Dominga Millan Santos
6   243         1898         474            India         Inez Estrada Malo
7   243         1898         341            India         Inez Estrada Malo
8   243         1898         223            India         Inez Estrada Malo
9   243         1898         946            India         Inez Estrada Malo
10  359         1882         584            India             Nikola Takacs
11  359         1882         359            India             Nikola Takacs
12  371         1898         635            India             Theresa Feher
13  376          815         378            India           Kristina Hovath
14  376          815         482            India           Kristina Hovath
15  403         1894         968            India            Agnes Korhonen
16  403         1894         576            India            Agnes Korhonen
17  575         1858          17            India              Maram Madani
18  575         1858         680            India              Maram Madani
19  575         1858         865            India              Maram Madani
20  594         1885         313            India               Mariam Alam
21  598         1877         462            India           Arub Estilidaei
22  676         1861         792            India                Agam Adrei
23  676         1861          56            India                Agam Adrei
24  676         1861         707            India                Agam Adrei
25  676         1861         389            India                Agam Adrei
26  721         1898         651            India                 Ayana Sow
27  721         1898         136            India                 Ayana Sow
28  745         1870         264            India             Shakila Cisse
29  745         1870         948            India             Shakila Cisse
30  745         1870         759            India             Shakila Cisse
31  748         1883         870            India              Yoruba Demoz
32  748         1883         845            India              Yoruba Demoz
33  853         1876         901            India            Xiang Wen-jing
34  853         1876         735            India            Xiang Wen-jing
35  853         1876         844            India            Xiang Wen-jing
36  858         1863         143            India             Hou Feng-ying
37  858         1863         994            India             Hou Feng-ying
38  997         1866         735            India           Bang Seong-shin
39  997         1866         990            India           Bang Seong-shin

In [83]:
# use pythonic syntax and pandas read_sql 
#to read output of an sql command into adata frame
product_query = 'select * from products where id <=100; '
df_from_db = pd.read_sql(product_query, conn)
print(df_from_db.head(10))

   id  price
0   0  21.78
1   1  18.48
2   2  24.17
3   3  29.71
4   4  20.12
5   5  27.55
6   6  14.90
7   7  26.75
8   8  21.49
9   9  26.35

# Bài tập thực hành

Bài 1. Hãy tạo 1 bảng có tên "company" trong database "testdb.db" với các trường thông tin (id: int; name: text; product_id: int; country: text)

Bài 2. Hãy thêm 3 thực thể (entity) vào bảng có tên "company" trong database "testdb.db";

Bài 3. Tạo 1 database có tên "testdb2"

Bài 4.Hãy đọc file `salaries.csv` vào pandas dataframe. Tải dataframe vào database "`testdb2`" và đặt tên bảng `salaries_tab`.

Bài 5. Xem 10 hàng đầu tiên của bảng `salaries_tab`

Bài 6. 
a. Hãy hiển thị thông tin Họ tên, nghề nghiệp của những nhân viên có mức lương cơ bản (BasePay) trên 200000. 

b. Hãy lưu thông tin Họ tên, nghề nghiệp, tên công ty (agency) của 100 nhân viên có mức lương tổng (TotalPayBenefits) cao nhất vào biến cục bộ `saved_results` và đọc kết quả về file `saved_results.csv`

Bài 7. Hãy đọc kết quả của truy vấn sql các thông tin Họ tên, nghề nghiệp, công ty của những nhân viên có mức lương tổng(TotalPayBenefits) dưới 100000 và lưu vào Pandas dataframe.
Hiển thị 5 dòng đầu của dataframe đó và đếm số lượng nhân viên.